netflux-project/app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "password", "subscription_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sidgi"], ["email", "samanduyev@gmail.com"], ["password", "1234567"], ["subscription_id", 2], ["created_at", "2019-05-31 19:23:17.626309"], ["updated_at", "2019-05-31 19:23:17.626309"]]
---
  def create
    @newCustomer = Customer.new(customer_params)
    if @newCustomer.save

UPDATE "customers" SET "name" = $1, "email" = $2, "password" = $3, "subscription_id" = $4, "updated_at" = $5 WHERE "customers"."id" = $6  [["name", "sasdasdad"], ["email", "sdfsdfsf"], ["password", "sdfsdfsf"], ["subscription_id", 1], ["updated_at", "2019-05-31 20:44:08.674465"], ["id", 26]]
---
  def update
     @customer.update(customer_params)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def get_customer
    @customer = Customer.find(params[:id])