netflux-project/app/controllers/subscriptions_controller.rb

SELECT "subscriptions".* FROM "subscriptions"
---
  def index
    @subscription  = Subscription.all